{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 80, 3], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_1_7x7/2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [7, 7]}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "conv_1_7x7/2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pool_1_3x3/2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv_1_7x7/2", 0, 0, {}]]], "name": "max_pool_1_3x3/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_2a_3x3/1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_1_3x3/2", 0, 0, {}]]], "name": "conv_2a_3x3/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_2b_3x3/1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_2a_3x3/1", 0, 0, {}]]], "name": "conv_2b_3x3/1"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pool_2_3x3/2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv_2b_3x3/1", 0, 0, {}]]], "name": "max_pool_2_3x3/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_506", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "name": "conv2d_506"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_508", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "name": "conv2d_508"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_82", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "name": "max_pooling2d_82"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_505", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "name": "conv2d_505"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_507", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_506", 0, 0, {}]]], "name": "conv2d_507"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_509", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_508", 0, 0, {}]]], "name": "conv2d_509"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_510", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_82", 0, 0, {}]]], "name": "conv2d_510"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_3a", "axis": 3}, "inbound_nodes": [[["conv2d_505", 0, 0, {}], ["conv2d_507", 0, 0, {}], ["conv2d_509", 0, 0, {}], ["conv2d_510", 0, 0, {}]]], "name": "inception_3a"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_512", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "name": "conv2d_512"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_514", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "name": "conv2d_514"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_83", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "name": "max_pooling2d_83"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_511", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "name": "conv2d_511"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_513", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_512", 0, 0, {}]]], "name": "conv2d_513"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_515", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_514", 0, 0, {}]]], "name": "conv2d_515"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_516", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_83", 0, 0, {}]]], "name": "conv2d_516"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_3b", "axis": 3}, "inbound_nodes": [[["conv2d_511", 0, 0, {}], ["conv2d_513", 0, 0, {}], ["conv2d_515", 0, 0, {}], ["conv2d_516", 0, 0, {}]]], "name": "inception_3b"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pool_3_3x3/2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["inception_3b", 0, 0, {}]]], "name": "max_pool_3_3x3/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_518", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "name": "conv2d_518"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_520", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "name": "conv2d_520"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_84", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "name": "max_pooling2d_84"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_517", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "name": "conv2d_517"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_519", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 208, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_518", 0, 0, {}]]], "name": "conv2d_519"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_521", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_520", 0, 0, {}]]], "name": "conv2d_521"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_522", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_84", 0, 0, {}]]], "name": "conv2d_522"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_4a", "axis": 3}, "inbound_nodes": [[["conv2d_517", 0, 0, {}], ["conv2d_519", 0, 0, {}], ["conv2d_521", 0, 0, {}], ["conv2d_522", 0, 0, {}]]], "name": "inception_4a"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_525", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 112, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "name": "conv2d_525"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_527", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "name": "conv2d_527"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_85", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "name": "max_pooling2d_85"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_524", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 160, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "name": "conv2d_524"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_526", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 224, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_525", 0, 0, {}]]], "name": "conv2d_526"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_528", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_527", 0, 0, {}]]], "name": "conv2d_528"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_529", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_85", 0, 0, {}]]], "name": "conv2d_529"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_4b", "axis": 3}, "inbound_nodes": [[["conv2d_524", 0, 0, {}], ["conv2d_526", 0, 0, {}], ["conv2d_528", 0, 0, {}], ["conv2d_529", 0, 0, {}]]], "name": "inception_4b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_531", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "name": "conv2d_531"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_533", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "name": "conv2d_533"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_86", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "name": "max_pooling2d_86"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_530", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "name": "conv2d_530"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_532", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_531", 0, 0, {}]]], "name": "conv2d_532"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_534", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_533", 0, 0, {}]]], "name": "conv2d_534"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_535", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_86", 0, 0, {}]]], "name": "conv2d_535"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_4c", "axis": 3}, "inbound_nodes": [[["conv2d_530", 0, 0, {}], ["conv2d_532", 0, 0, {}], ["conv2d_534", 0, 0, {}], ["conv2d_535", 0, 0, {}]]], "name": "inception_4c"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_537", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "name": "conv2d_537"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_539", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "name": "conv2d_539"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_87", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "name": "max_pooling2d_87"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_536", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 112, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "name": "conv2d_536"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_538", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 288, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_537", 0, 0, {}]]], "name": "conv2d_538"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_540", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_539", 0, 0, {}]]], "name": "conv2d_540"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_541", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_87", 0, 0, {}]]], "name": "conv2d_541"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_4d", "axis": 3}, "inbound_nodes": [[["conv2d_536", 0, 0, {}], ["conv2d_538", 0, 0, {}], ["conv2d_540", 0, 0, {}], ["conv2d_541", 0, 0, {}]]], "name": "inception_4d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_544", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 160, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "name": "conv2d_544"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_546", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "name": "conv2d_546"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_88", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "name": "max_pooling2d_88"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_543", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "name": "conv2d_543"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_545", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 320, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_544", 0, 0, {}]]], "name": "conv2d_545"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_547", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_546", 0, 0, {}]]], "name": "conv2d_547"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_548", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_88", 0, 0, {}]]], "name": "conv2d_548"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_4e", "axis": 3}, "inbound_nodes": [[["conv2d_543", 0, 0, {}], ["conv2d_545", 0, 0, {}], ["conv2d_547", 0, 0, {}], ["conv2d_548", 0, 0, {}]]], "name": "inception_4e"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pool_4_3x3/2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["inception_4e", 0, 0, {}]]], "name": "max_pool_4_3x3/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_550", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 160, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "name": "conv2d_550"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_552", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "name": "conv2d_552"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_89", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "name": "max_pooling2d_89"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_549", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "name": "conv2d_549"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_551", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 320, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_550", 0, 0, {}]]], "name": "conv2d_551"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_553", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_552", 0, 0, {}]]], "name": "conv2d_553"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_554", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_89", 0, 0, {}]]], "name": "conv2d_554"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_5a", "axis": 3}, "inbound_nodes": [[["conv2d_549", 0, 0, {}], ["conv2d_551", 0, 0, {}], ["conv2d_553", 0, 0, {}], ["conv2d_554", 0, 0, {}]]], "name": "inception_5a"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_556", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "name": "conv2d_556"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_558", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "name": "conv2d_558"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_90", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "name": "max_pooling2d_90"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_19", "trainable": true, "data_format": "channels_last", "pool_size": [5, 5], "padding": "valid", "strides": [3, 3]}, "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "name": "average_pooling2d_19"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_20", "trainable": true, "data_format": "channels_last", "pool_size": [5, 5], "padding": "valid", "strides": [3, 3]}, "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "name": "average_pooling2d_20"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_555", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "name": "conv2d_555"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_557", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_556", 0, 0, {}]]], "name": "conv2d_557"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_559", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_558", 0, 0, {}]]], "name": "conv2d_559"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_560", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_90", 0, 0, {}]]], "name": "conv2d_560"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_523", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_19", 0, 0, {}]]], "name": "conv2d_523"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_542", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_20", 0, 0, {}]]], "name": "conv2d_542"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "inception_5b", "axis": 3}, "inbound_nodes": [[["conv2d_555", 0, 0, {}], ["conv2d_557", 0, 0, {}], ["conv2d_559", 0, 0, {}], ["conv2d_560", 0, 0, {}]]], "name": "inception_5b"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_19", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_523", 0, 0, {}]]], "name": "flatten_19"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_20", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_542", 0, 0, {}]]], "name": "flatten_20"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "avg_pool_5_3x3/1", "data_format": "channels_last"}, "inbound_nodes": [[["inception_5b", 0, 0, {}]]], "name": "avg_pool_5_3x3/1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_19", 0, 0, {}]]], "name": "dense_19"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "name": "dense_20"}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_30"}, "inbound_nodes": [[["avg_pool_5_3x3/1", 0, 0, {}]]], "name": "dropout_30"}, {"class_name": "Dropout", "config": {"rate": 0.7, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_28"}, "inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "dropout_28"}, {"class_name": "Dropout", "config": {"rate": 0.7, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_29"}, "inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "dropout_29"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]], "name": "output"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "auxilliary_output_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]], "name": "auxilliary_output_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "auxilliary_output_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": 