__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 80, 80, 3)    0                                            
__________________________________________________________________________________________________
conv_1_7x7/2 (Conv2D)           (None, 40, 40, 64)   9472        input_1[0][0]                    
__________________________________________________________________________________________________
max_pool_1_3x3/2 (MaxPooling2D) (None, 20, 20, 64)   0           conv_1_7x7/2[0][0]               
__________________________________________________________________________________________________
conv_2a_3x3/1 (Conv2D)          (None, 20, 20, 64)   4160        max_pool_1_3x3/2[0][0]           
__________________________________________________________________________________________________
conv_2b_3x3/1 (Conv2D)          (None, 20, 20, 192)  110784      conv_2a_3x3/1[0][0]              
__________________________________________________________________________________________________
max_pool_2_3x3/2 (MaxPooling2D) (None, 10, 10, 192)  0           conv_2b_3x3/1[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 10, 10, 96)   18528       max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 10, 10, 16)   3088        max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 10, 10, 192)  0           max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 10, 10, 64)   12352       max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 10, 10, 128)  110720      conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 10, 10, 32)   12832       conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 10, 10, 32)   6176        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
inception_3a (Concatenate)      (None, 10, 10, 256)  0           conv2d_1[0][0]                   
                                                                 conv2d_3[0][0]                   
                                                                 conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 10, 128)  32896       inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 10, 10, 32)   8224        inception_3a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 10, 10, 256)  0           inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 10, 10, 128)  32896       inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 10, 10, 192)  221376      conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 10, 10, 96)   76896       conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 10, 10, 64)   16448       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
inception_3b (Concatenate)      (None, 10, 10, 480)  0           conv2d_7[0][0]                   
                                                                 conv2d_9[0][0]                   
                                                                 conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pool_3_3x3/2 (MaxPooling2D) (None, 5, 5, 480)    0           inception_3b[0][0]               
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 5, 5, 96)     46176       max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 5, 5, 16)     7696        max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 5, 5, 480)    0           max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 5, 5, 192)    92352       max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 5, 5, 208)    179920      conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 5, 5, 48)     19248       conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 5, 5, 64)     30784       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
inception_4a (Concatenate)      (None, 5, 5, 512)    0           conv2d_13[0][0]                  
                                                                 conv2d_15[0][0]                  
                                                                 conv2d_17[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 5, 5, 112)    57456       inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 5, 5, 24)     12312       inception_4a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 5, 5, 512)    0           inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 5, 5, 160)    82080       inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 5, 5, 224)    226016      conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 5, 5, 64)     38464       conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
inception_4b (Concatenate)      (None, 5, 5, 512)    0           conv2d_20[0][0]                  
                                                                 conv2d_22[0][0]                  
                                                                 conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 5, 5, 128)    65664       inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 5, 5, 24)     12312       inception_4b[0][0]               
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 5, 5, 512)    0           inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 5, 5, 128)    65664       inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 5, 5, 256)    295168      conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 5, 5, 64)     38464       conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
inception_4c (Concatenate)      (None, 5, 5, 512)    0           conv2d_26[0][0]                  
                                                                 conv2d_28[0][0]                  
                                                                 conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 5, 5, 144)    73872       inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 5, 5, 32)     16416       inception_4c[0][0]               
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 5, 5, 512)    0           inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 5, 5, 112)    57456       inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 5, 5, 288)    373536      conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 5, 5, 64)     51264       conv2d_35[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
inception_4d (Concatenate)      (None, 5, 5, 528)    0           conv2d_32[0][0]                  
                                                                 conv2d_34[0][0]                  
                                                                 conv2d_36[0][0]                  
                                                                 conv2d_37[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 5, 5, 160)    84640       inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 5, 5, 32)     16928       inception_4d[0][0]               
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 5, 5, 528)    0           inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 5, 5, 256)    135424      inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 5, 5, 320)    461120      conv2d_40[0][0]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 5, 5, 128)    102528      conv2d_42[0][0]                  
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 5, 5, 128)    67712       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
inception_4e (Concatenate)      (None, 5, 5, 832)    0           conv2d_39[0][0]                  
                                                                 conv2d_41[0][0]                  
                                                                 conv2d_43[0][0]                  
                                                                 conv2d_44[0][0]                  
__________________________________________________________________________________________________
max_pool_4_3x3/2 (MaxPooling2D) (None, 3, 3, 832)    0           inception_4e[0][0]               
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 3, 3, 160)    133280      max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 3, 3, 32)     26656       max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 3, 3, 832)    0           max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 3, 3, 256)    213248      max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 3, 3, 320)    461120      conv2d_46[0][0]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 3, 3, 128)    102528      conv2d_48[0][0]                  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 3, 3, 128)    106624      max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
inception_5a (Concatenate)      (None, 3, 3, 832)    0           conv2d_45[0][0]                  
                                                                 conv2d_47[0][0]                  
                                                                 conv2d_49[0][0]                  
                                                                 conv2d_50[0][0]                  
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 3, 3, 192)    159936      inception_5a[0][0]               
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 3, 3, 48)     39984       inception_5a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 3, 3, 832)    0           inception_5a[0][0]               
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 512)    0           inception_4a[0][0]               
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 1, 1, 528)    0           inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 3, 3, 384)    319872      inception_5a[0][0]               
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 3, 3, 384)    663936      conv2d_52[0][0]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 3, 3, 128)    153728      conv2d_54[0][0]                  
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 3, 3, 128)    106624      max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 1, 128)    65664       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 1, 1, 128)    67712       average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
inception_5b (Concatenate)      (None, 3, 3, 1024)   0           conv2d_51[0][0]                  
                                                                 conv2d_53[0][0]                  
                                                                 conv2d_55[0][0]                  
                                                                 conv2d_56[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 128)          0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 128)          0           conv2d_38[0][0]                  
__________________________________________________________________________________________________
avg_pool_5_3x3/1 (GlobalAverage (None, 1024)         0           inception_5b[0][0]               
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         132096      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1024)         132096      flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1024)         0           avg_pool_5_3x3/1[0][0]           
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 2)            2050        dropout_3[0][0]                  
__________________________________________________________________________________________________
auxilliary_output_1 (Dense)     (None, 2)            2050        dropout_1[0][0]                  
__________________________________________________________________________________________________
auxilliary_output_2 (Dense)     (None, 2)            2050        dropout_2[0][0]                  
==================================================================================================
Total params: 6,377,270
Trainable params: 6,377,270
Non-trainable params: 0
__________________________________________________________________________________________________
