__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 80, 80, 3)    0                                            
__________________________________________________________________________________________________
conv_1_7x7/2 (Conv2D)           (None, 40, 40, 64)   9472        input_1[0][0]                    
__________________________________________________________________________________________________
max_pool_1_3x3/2 (MaxPooling2D) (None, 20, 20, 64)   0           conv_1_7x7/2[0][0]               
__________________________________________________________________________________________________
conv_2a_3x3/1 (Conv2D)          (None, 20, 20, 64)   4160        max_pool_1_3x3/2[0][0]           
__________________________________________________________________________________________________
conv_2b_3x3/1 (Conv2D)          (None, 20, 20, 192)  110784      conv_2a_3x3/1[0][0]              
__________________________________________________________________________________________________
max_pool_2_3x3/2 (MaxPooling2D) (None, 10, 10, 192)  0           conv_2b_3x3/1[0][0]              
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 10, 10, 96)   18528       max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 10, 10, 16)   3088        max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 10, 10, 192)  0           max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 10, 10, 64)   12352       max_pool_2_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 10, 10, 128)  110720      conv2d_58[0][0]                  
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 10, 10, 32)   12832       conv2d_60[0][0]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 10, 10, 32)   6176        max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
inception_3a (Concatenate)      (None, 10, 10, 256)  0           conv2d_57[0][0]                  
                                                                 conv2d_59[0][0]                  
                                                                 conv2d_61[0][0]                  
                                                                 conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 10, 10, 128)  32896       inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 10, 10, 32)   8224        inception_3a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 10, 10, 256)  0           inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 10, 10, 128)  32896       inception_3a[0][0]               
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 10, 10, 192)  221376      conv2d_64[0][0]                  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 10, 10, 96)   76896       conv2d_66[0][0]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 10, 10, 64)   16448       max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
inception_3b (Concatenate)      (None, 10, 10, 480)  0           conv2d_63[0][0]                  
                                                                 conv2d_65[0][0]                  
                                                                 conv2d_67[0][0]                  
                                                                 conv2d_68[0][0]                  
__________________________________________________________________________________________________
max_pool_3_3x3/2 (MaxPooling2D) (None, 5, 5, 480)    0           inception_3b[0][0]               
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 5, 5, 96)     46176       max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 5, 5, 16)     7696        max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 5, 5, 480)    0           max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 5, 5, 192)    92352       max_pool_3_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 5, 5, 208)    179920      conv2d_70[0][0]                  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 5, 5, 48)     19248       conv2d_72[0][0]                  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 5, 5, 64)     30784       max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
inception_4a (Concatenate)      (None, 5, 5, 512)    0           conv2d_69[0][0]                  
                                                                 conv2d_71[0][0]                  
                                                                 conv2d_73[0][0]                  
                                                                 conv2d_74[0][0]                  
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 5, 5, 112)    57456       inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 5, 5, 24)     12312       inception_4a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 5, 5, 512)    0           inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 5, 5, 160)    82080       inception_4a[0][0]               
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 5, 5, 224)    226016      conv2d_77[0][0]                  
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 5, 5, 64)     38464       conv2d_79[0][0]                  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
inception_4b (Concatenate)      (None, 5, 5, 512)    0           conv2d_76[0][0]                  
                                                                 conv2d_78[0][0]                  
                                                                 conv2d_80[0][0]                  
                                                                 conv2d_81[0][0]                  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 5, 5, 128)    65664       inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 5, 5, 24)     12312       inception_4b[0][0]               
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 5, 5, 512)    0           inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 5, 5, 128)    65664       inception_4b[0][0]               
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 5, 5, 256)    295168      conv2d_83[0][0]                  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 5, 5, 64)     38464       conv2d_85[0][0]                  
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
inception_4c (Concatenate)      (None, 5, 5, 512)    0           conv2d_82[0][0]                  
                                                                 conv2d_84[0][0]                  
                                                                 conv2d_86[0][0]                  
                                                                 conv2d_87[0][0]                  
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 5, 5, 144)    73872       inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 5, 5, 32)     16416       inception_4c[0][0]               
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 5, 5, 512)    0           inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 5, 5, 112)    57456       inception_4c[0][0]               
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 5, 5, 288)    373536      conv2d_89[0][0]                  
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 5, 5, 64)     51264       conv2d_91[0][0]                  
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 5, 5, 64)     32832       max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
inception_4d (Concatenate)      (None, 5, 5, 528)    0           conv2d_88[0][0]                  
                                                                 conv2d_90[0][0]                  
                                                                 conv2d_92[0][0]                  
                                                                 conv2d_93[0][0]                  
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 5, 5, 160)    84640       inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 5, 5, 32)     16928       inception_4d[0][0]               
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 5, 5, 528)    0           inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 5, 5, 256)    135424      inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 5, 5, 320)    461120      conv2d_96[0][0]                  
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 5, 5, 128)    102528      conv2d_98[0][0]                  
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 5, 5, 128)    67712       max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
inception_4e (Concatenate)      (None, 5, 5, 832)    0           conv2d_95[0][0]                  
                                                                 conv2d_97[0][0]                  
                                                                 conv2d_99[0][0]                  
                                                                 conv2d_100[0][0]                 
__________________________________________________________________________________________________
max_pool_4_3x3/2 (MaxPooling2D) (None, 3, 3, 832)    0           inception_4e[0][0]               
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 3, 3, 160)    133280      max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 3, 3, 32)     26656       max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 3, 3, 832)    0           max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 3, 3, 256)    213248      max_pool_4_3x3/2[0][0]           
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 3, 3, 320)    461120      conv2d_102[0][0]                 
__________________________________________________________________________________________________
conv2d_105 (Conv2D)             (None, 3, 3, 128)    102528      conv2d_104[0][0]                 
__________________________________________________________________________________________________
conv2d_106 (Conv2D)             (None, 3, 3, 128)    106624      max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
inception_5a (Concatenate)      (None, 3, 3, 832)    0           conv2d_101[0][0]                 
                                                                 conv2d_103[0][0]                 
                                                                 conv2d_105[0][0]                 
                                                                 conv2d_106[0][0]                 
__________________________________________________________________________________________________
conv2d_108 (Conv2D)             (None, 3, 3, 192)    159936      inception_5a[0][0]               
__________________________________________________________________________________________________
conv2d_110 (Conv2D)             (None, 3, 3, 48)     39984       inception_5a[0][0]               
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 3, 3, 832)    0           inception_5a[0][0]               
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 1, 1, 512)    0           inception_4a[0][0]               
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 1, 1, 528)    0           inception_4d[0][0]               
__________________________________________________________________________________________________
conv2d_107 (Conv2D)             (None, 3, 3, 384)    319872      inception_5a[0][0]               
__________________________________________________________________________________________________
conv2d_109 (Conv2D)             (None, 3, 3, 384)    663936      conv2d_108[0][0]                 
__________________________________________________________________________________________________
conv2d_111 (Conv2D)             (None, 3, 3, 128)    153728      conv2d_110[0][0]                 
__________________________________________________________________________________________________
conv2d_112 (Conv2D)             (None, 3, 3, 128)    106624      max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 1, 1, 128)    65664       average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 1, 1, 128)    67712       average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
inception_5b (Concatenate)      (None, 3, 3, 1024)   0           conv2d_107[0][0]                 
                                                                 conv2d_109[0][0]                 
                                                                 conv2d_111[0][0]                 
                                                                 conv2d_112[0][0]                 
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 128)          0           conv2d_75[0][0]                  
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 128)          0           conv2d_94[0][0]                  
__________________________________________________________________________________________________
avg_pool_5_3x3/1 (GlobalAverage (None, 1024)         0           inception_5b[0][0]               
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         132096      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1024)         132096      flatten_4[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 1024)         0           avg_pool_5_3x3/1[0][0]           
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 1024)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1024)         0           dense_4[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 2)            2050        dropout_6[0][0]                  
__________________________________________________________________________________________________
auxilliary_output_1 (Dense)     (None, 2)            2050        dropout_4[0][0]                  
__________________________________________________________________________________________________
auxilliary_output_2 (Dense)     (None, 2)            2050        dropout_5[0][0]                  
==================================================================================================
Total params: 6,377,270
Trainable params: 6,377,270
Non-trainable params: 0
__________________________________________________________________________________________________
