_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 82, 82, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 80, 80, 8)         80        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 40, 40, 8)         0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 42, 42, 8)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 40, 40, 16)        1168      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 20, 16)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 22, 22, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 20, 20, 32)        4640      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 10, 10, 32)        9248      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 800)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               102528    
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 258       
=================================================================
Total params: 117,922
Trainable params: 117,922
Non-trainable params: 0
_________________________________________________________________
